# 개요  
3주차 pandaas DataFrame을 만드는 법에 대해 알아보겠습니다.  
DF는 csv 파일 외에도 다양한 데이터로부터 생성이 가능합니다

# 1. DF 처음부터 만들기  
DF를 만들기 위해서 가장 기본적인 방법은 같은 길이를 가진 리스트를 연결하는 것입니다.

In [2]:
import pandas as pd
import numpy as np

딕셔너리는 앞의 갚을 Key, 뒤의 값을 Value 라고 하죠.  
그리고 이 딕셔너리를 통째로 pd.DataFrame에 넣어주면 데이터프레임이 작성되죠.

In [3]:
list1=['홍','김','이','박','최']
list2=['길동','철수','성계','지성','용수']
list3=[23,45,99,41,48]

names_dic={'family_name':list1,'first_name':list2,'age':list3}
names=pd.DataFrame(names_dic)
names

  family_name first_name  age
0           홍         길동   23
1           김         철수   45
2           이         성계   99
3           박         지성   41
4           최         용수   48

In [4]:
list(zip(list1,list2,list3))

[('홍', '길동', 23),
 ('김', '철수', 45),
 ('이', '성계', 99),
 ('박', '지성', 41),
 ('최', '용수', 48)]

혹은 이 방법도 가능합니다.

In [5]:
pd.DataFrame(list(zip(list1,list2,list3)),columns=['familyName','firstName','age'])

  familyName firstName  age
0          홍        길동   23
1          김        철수   45
2          이        성계   99
3          박        지성   41
4          최        용수   48

In [6]:
np.arange(0,4)

array([0, 1, 2, 3])

In [7]:
list(zip(list1,list2,list3))

[('홍', '길동', 23),
 ('김', '철수', 45),
 ('이', '성계', 99),
 ('박', '지성', 41),
 ('최', '용수', 48)]

In [8]:
list4=np.arange(0,4)
pd.DataFrame(list(zip(list1,list2,list4)),columns=['familyName','firstName','age'])

  familyName firstName  age
0          홍        길동    0
1          김        철수    1
2          이        성계    2
3          박        지성    3

일부러 에러를 내보겠습니다.  
어레이가 같은 길이를 같지 않으면 딕셔너리 형태로 데이터 프레임을 만들 수 없습니다.

In [9]:
names_dic_short={'family_name':list1,'first_name':list2,'age':list4}
pd.DataFrame(names_dic_short)

ValueError: arrays must all be same length

DF는 index, columns, data로 구성됩니다. data와 cloumns은 구성한 것 같은데, index 정보를 넣지 않았습니다. 이번에 해당 정보를 추가해 DF를 만들어 보겠습니다.

In [10]:
names.index

RangeIndex(start=0, stop=5, step=1)

In [11]:
name_dic={'family+name':list1,'first_name':list2,'age':list3}
names=pd.DataFrame(names_dic,index=['1번학생','2번학생','3번학생','4번학생','5번학생'])
names

     family_name first_name  age
1번학생           홍         길동   23
2번학생           김         철수   45
3번학생           이         성계   99
4번학생           박         지성   41
5번학생           최         용수   48

여기서 내가 원하는 순서대로 컬럼의 순서를 맞추고 싶다면 2주차에서 배운 내용들을 활용할 수 있습니다. 하지만 DF 생성에 바로 적용할 수 있습니다.  
age,first_name,family_name 순서로 만들고 싶다고 가정해 보겠습니다.

In [12]:
names=pd.DataFrame(names_dic,index=['1번학생','2번학생','3번학생','4번학생','5번학생'],columns=['age','first_name','family_name'])
names

      age first_name family_name
1번학생   23         길동           홍
2번학생   45         철수           김
3번학생   99         성계           이
4번학생   41         지성           박
5번학생   48         용수           최

정리하자면, DataFrame을 만들 때, data, index, columns을 따로 지정할 수 있다는 것입니다.

# 2.DF를 csv로 저장하기  
DF를 csv로 저장할 때에는, to_csv 메서드를 사용합니다.

In [13]:
names = pd.DataFrame(names_dic)
names.to_csv('names.csv',index=False)
new_names = pd.read_csv('names.csv',index_col=0)

In [14]:
#new_names.drop(columns=new_names.columns[0])
#new_names.iloc[:, 1:]
new_names

            first_name  age
family_name
홍                   길동   23
김                   철수   45
이                   성계   99
박                   지성   41
최                   용수   48

코드를 보면 첫 컬럼에 희안한 값이 들어가 있죠?  
이는 index 정보를 담고 있는 column 입니다.  
이 지저분한 열을 처리하는 것엔 크게 몇 가지 방법이 있습니다.  
먼저 저장할 때 index를 포함하지 않는 것이죠.  
names.to_csv('names.csv', index=False)  
아니면, 저 특정 열을 index 로 지정해서 처리하는 방법입니다.  
index_col 은 index로 사용할 컬럼의 위치가 몇 번째인지 지정합니다.  
pd.read_csv('names.csv', index_col=0)

# 3. 대용량 csv 파일 읽기  
첫 시간에 pandas는 인메모리 (in-memory), 즉 메모리에 모든 데이터를 불러와 한 PC에서 사용할 수 있다고 배웠습니다. 만약 메모리가 충분히 크다면 데이터를 불러와 처리하는 것이 어렵지 않겠지만, GB가 넘어가는
파일을 불러오게 되면 장담할 수 없습니다.  
이런 경우 할 수 있는 행동은  
1. 더 큰 메모리 (구매 or 클라우드)  
2. 파일 작게 자르기 (piece by piece)  
3. 메모리를 적게 소비하는 구조 만들기  
4. 디스크 형태의 구조를 사용하기 (dask)   

여기서는 3번에 대해 배워보겠습니다.  
이 절에서는 diamonds 데이터를 이용합니다.

In [15]:
diamonds = pd.read_csv('data/diamonds.csv', nrows=1000)
diamonds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   carat    1000 non-null   float64
 1   cut      1000 non-null   object
 2   color    1000 non-null   object
 3   clarity  1000 non-null   object
 4   depth    1000 non-null   float64
 5   table    1000 non-null   float64
 6   price    1000 non-null   int64
 7   x        1000 non-null   float64
 8   y        1000 non-null   float64
 9   z        1000 non-null   float64
dtypes: float64(6), int64(1), object(3)
memory usage: 78.2+ KB

info 함수로 보면, 총 78.2kb 의 메모리가 필요합니다. 만약 1억 행이 존재한다면 7.8G가 되는 것이죠.   운영체
제가 사용하는 공간과, 데이터 변환을 위한 공간을 생각해보면, 16G의 램으로 간당간당 합니다.  
info 에서 힌트를 얻어 메모리를 줄여볼까요?  
Dtype 을 변경하는 겁니다!  
예를 들어, float64 의 경우 뒤의 숫자가 클수록 더 정교한 (더 자리수가 많은) 숫자를 의미합니다.   그만큼 메
모리를 더 차지한다는 얘기죠.  
아래의 결과를 차례대로 봅시다.  
np.finfo 는 numpy 에서 사용하는 float 값들의 정보를 보여줍니다

In [16]:

np.finfo('float64')

finfo(resolution=1e-15, min=-1.7976931348623157e+308, max=1.7976931348623157e+308, dtype=float64)

In [17]:

np.finfo('float32')

finfo(resolution=1e-06, min=-3.4028235e+38, max=3.4028235e+38, dtype=float32)

In [18]:

np.finfo('float16')

finfo(resolution=0.001, min=-6.55040e+04, max=6.55040e+04, dtype=float16)

In [19]:

np.finfo('float16')

finfo(resolution=0.001, min=-6.55040e+04, max=6.55040e+04, dtype=float16)

In [20]:

np.finfo('float16')

finfo(resolution=0.001, min=-6.55040e+04, max=6.55040e+04, dtype=float16)

In [21]:

np.iinfo('int64')

iinfo(min=-9223372036854775808, max=9223372036854775807, dtype=int64)

In [22]:
#price 는 아래와 같이 바꾸면 되겠네요!
np.iinfo('int16')

iinfo(min=-32768, max=32767, dtype=int16)

In [23]:

np.iinfo('int32')

iinfo(min=-2147483648, max=2147483647, dtype=int32)

In [24]:

np.iinfo('int8')

iinfo(min=-128, max=127, dtype=int8)

직접 데이터 타입을 매칭시켜 데이터 타입을 지정해 줄 수 있구요. 그렇지 않다면 기본적인 데이터 프레임 타입을 따르게 됩니다.

In [25]:
diamonds2 = pd.read_csv('data/diamonds.csv', nrows=1000,
 dtype={
 'carat': np.float16,
 'depth': np.float16,
 'table': np.float16,
 'x': np.float16,
 'y': np.float16,
 'z': np.float16,
 'price': np.int16
 })
diamonds2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   carat    1000 non-null   float16
 1   cut      1000 non-null   object
 2   color    1000 non-null   object
 3   clarity  1000 non-null   object
 4   depth    1000 non-null   float16
 5   table    1000 non-null   float16
 6   price    1000 non-null   int16
 7   x        1000 non-null   float16
 8   y        1000 non-null   float16
 9   z        1000 non-null   float16
dtypes: float16(6), int16(1), object(3)
memory usage: 37.2+ KB

In [26]:

round(37.2/78.2, 2)

0.48

In [27]:

diamonds2.cut.value_counts()

Ideal        333
Premium      290
Very Good    226
Good          89
Fair          62
Name: cut, dtype: int64

In [28]:

diamonds2.cut.value_counts()

Ideal        333
Premium      290
Very Good    226
Good          89
Fair          62
Name: cut, dtype: int64

In [29]:
diamonds2.clarity.value_counts()

SI1     306
VS2     218
VS1     159
SI2     154
VVS2     62
VVS1     58
I1       29
IF       14
Name: clarity, dtype: int64

In [30]:
diamonds3 = pd.read_csv('data/diamonds.csv', nrows=1000,
 dtype={
 'carat': np.float16,
 'depth': np.float16,
 'table': np.float16,
 'x': np.float16,
 'y': np.float16,
 'z': np.float16,
 'price': np.int16,
 'color': 'category',
 'cut': 'category',
 'clarity': 'category'
 })
diamonds3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   carat    1000 non-null   float16
 1   cut      1000 non-null   category
 2   color    1000 non-null   category
 3   clarity  1000 non-null   category
 4   depth    1000 non-null   float16
 5   table    1000 non-null   float16
 6   price    1000 non-null   int16
 7   x        1000 non-null   float16
 8   y        1000 non-null   float16
 9   z        1000 non-null   float16
dtypes: category(3), float16(6), int16(1)
memory usage: 17.7 KB

In [31]:

round(17.6/78.2, 2)

0.23

# 이래도 메모리가 부족하다.?
그럼 특정컬럼만 불러와서 사용하죠.  
usecols는 이 컬럼들만 불러와서 사용하겠다라는 뜻입니다.

In [32]:
cols = ['carat', 'cut', 'color', 'clarity', 'depth', 'table', 'price']
diamonds4 = pd.read_csv('data/diamonds.csv', nrows=1000,
 dtype={
 'carat': np.float16,
 'depth': np.float16,
 'price': np.int16,
 'table': np.float16,
 'color': 'category',
 'cut': 'category',
 'clarity': 'category'
 },
 usecols=cols)
diamonds4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   carat    1000 non-null   float16
 1   cut      1000 non-null   category
 2   color    1000 non-null   category
 3   clarity  1000 non-null   category
 4   depth    1000 non-null   float16
 5   table    1000 non-null   float16
 6   price    1000 non-null   int16
dtypes: category(3), float16(3), int16(1)
memory usage: 11.8 KB

# 이래도 메모리를 더 줄어야한다? 
# 청크사이즈 활용하기

In [33]:
cols = ['carat', 'cut', 'color', 'clarity', 'depth', 'table', 'price']
diamonds_iter = pd.read_csv('data/diamonds.csv', nrows=1000,
 dtype={
 'carat': np.float16,
 'depth': np.float16,
 'price': np.int16,
 'color': 'category',
 'cut': 'category',
 'clarity': 'category'
 },
 usecols=cols,
 chunksize=200 #이 부분이죠!
 )
def process(df):
 return f'processed {df.shape} shape of df'
for chunk in diamonds_iter:
 print(process(chunk))

processed (200, 7) shape of df
processed (200, 7) shape of df
processed (200, 7) shape of df
processed (200, 7) shape of df
processed (200, 7) shape of df

# 3. 엑셀 파일 읽기/ 쓰기

In [34]:
diamonds.to_excel('dia.xlsx', sheet_name='test')

In [35]:
diamonds.to_excel('dia.xlsx', sheet_name='test')

# 4. DB와의 작업

In [39]:
import sqlite3
# db 파일과 연결
con = sqlite3.connect('data/beat.db')
with con:
     cur = con.cursor() #cursor 객체를 만들고, 쿼리를 하나씩 실행합니다.
     cur.execute(drop table band) # 이 부분은 최초 실행할 때엔 주석처리합니다.
     cur.execute(
     create table band(  #테이블 만드는 부분
     id integer primary key,
     fname text,
     lname text,
     birthyear int)
     )

     cur.execute(  #테이블에 값을 넣는 부분

     insert into band values (0, 'paul', 'McCartney', 1942)
     )

     cur.execute(

     insert into band values (1, 'John', 'Lennon', 1940)
     )

     con.commit()  #최종적으로 저장

SyntaxError: invalid syntax (<ipython-input-39-700d4f1f505b>, line 6)

In [41]:
# sqlalchemy 를 이용해 db 파일에서 read_sql 을 수행합니다.
import sqlalchemy as sa
engine = sa.create_engine('sqlite:///data/beat.db', echo=True)
sa_connection = engine.connect()
beat = pd.read_sql('band', sa_connection, index_col='id')
# band 테이블을 sa_connection에서 가져옵니다.

2021-03-28 08:35:26,216 INFO sqlalchemy.engine.base.Engine SELECT CAST('test plain returns' AS VARCHAR(60)) AS anon_1
2021-03-28 08:35:26,217 INFO sqlalchemy.engine.base.Engine ()
2021-03-28 08:35:26,218 INFO sqlalchemy.engine.base.Engine SELECT CAST('test unicode returns' AS VARCHAR(60)) AS anon_1
2021-03-28 08:35:26,219 INFO sqlalchemy.engine.base.Engine ()
2021-03-28 08:35:26,220 INFO sqlalchemy.engine.base.Engine PRAGMA main.table_info("band")
2021-03-28 08:35:26,221 INFO sqlalchemy.engine.base.Engine ()
2021-03-28 08:35:26,223 INFO sqlalchemy.engine.base.Engine PRAGMA temp.table_info("band")
2021-03-28 08:35:26,224 INFO sqlalchemy.engine.base.Engine ()
2021-03-28 08:35:26,225 INFO sqlalchemy.engine.base.Engine band
2021-03-28 08:35:26,226 INFO sqlalchemy.engine.base.Engine ()
2021-03-28 08:35:26,227 INFO sqlalchemy.engine.base.Engine ROLLBACK

OperationalError: (sqlite3.OperationalError) near "band": syntax error
[SQL: band]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [42]:
beat

NameError: name 'beat' is not defined

In [43]:
sql = '''select fname, birthyear from band'''
fnames = pd.read_sql(sql, con)
fnames

DatabaseError: Execution failed on sql 'select fname, birthyear from band': no such table: band

# 5. JSON 읽기

JSON(JavaScript Object Notation)은 인터넷에서 데이터를 저장할 때 흔히 쓰는 형식입니다. (XML과 함께 말이죠.) python에서는 json 라이브러리로 해당 파일들을 다룰 수 있습니다. dictionary를 json으로, 다시 json을 dictionary로 바꾸는 예제를 수행해 보도록 하겠습니다.

In [42]:

names_dic

{'family_name': ['홍', '김', '이', '박', '최'],
 'first_name': ['길동', '철수', '성계', '지성', '용수'],
 'age': [23, 45, 99, 41, 48]}

In [43]:
import json
#encoded = json.dumps(names_dic)
#데이터에는 문제가 없지만, 깨져서 나오는 게 보기 싫을 땐 아래와 같이 해줍니다.
encoded = json.dumps(names_dic, ensure_ascii=False)
encoded

'{"family_name": ["홍", "김", "이", "박", "최"], "first_name": ["길동", "철수", "성계", "지성", "용수"], "age": [23, 45, 99, 41, 48]}'

In [44]:
json.loads(encoded)

{'family_name': ['홍', '김', '이', '박', '최'],
 'first_name': ['길동', '철수', '성계', '지성', '용수'],
 'age': [23, 45, 99, 41, 48]}

json은 DF와 다르게 여러 단계(level)을 가질 수 있기 때문에, 표 형태로 잘 나타낼 수 있는 경우에만 pandas가 다룰 수 있습니다.  
pandas는 다음과 같은 json 방향(orientation)을 지원합니다.  
각각의 차이는 하나씩 실행해보면서 확인해보도록 하죠.  
- columns
- records 
- split
- index 
- values 
- table

In [47]:
#records 는 행의 리스트로 표현합니다.
json_records = names.to_json(orient='records', force_ascii=False)
json_records

'[{"family_name":"홍","first_name":"길동","age":23},{"family_name":"김","first_name":"철수","age":45},{"family_name":"이","first_name":"성계","age":99},{"family_name":"박","first_name":"지성","age":41},{"family_name":"최","first_name":"용수","age":48}]'

In [48]:
pd.read_json(json_records)

  family_name first_name  age
0           홍         길동   23
1           김         철수   45
2           이         성계   99
3           박         지성   41
4           최         용수   48

In [49]:
#split 은 columns, index, data 를 따로따로 저장합니다.
json_split = names.to_json(orient='split', force_ascii=False)
json_split

'{"columns":["family_name","first_name","age"],"index":[0,1,2,3,4],"data":[["홍","길동",23],["김","철수",45],["이","성계",99],["박","지성",41],["최","용수",48]]}'

In [50]:
#split 은 columns, index, data 를 따로따로 저장합니다.
json_split = names.to_json(orient='split', force_ascii=False)
json_split

'{"columns":["family_name","first_name","age"],"index":[0,1,2,3,4],"data":[["홍","길동",23],["김","철수",45],["이","성계",99],["박","지성",41],["최","용수",48]]}'

In [51]:
#index 는 index 값을 행에 매핑합니다.
json_index = names.to_json(orient='index', force_ascii=False)
json_index

'{"0":{"family_name":"홍","first_name":"길동","age":23},"1":{"family_name":"김","first_name":"철수","age":45},"2":{"family_name":"이","first_name":"성계","age":99},"3":{"family_name":"박","first_name":"지성","age":41},"4":{"family_name":"최","first_name":"용수","age":48}}'

In [52]:
#index 는 index 값을 행에 매핑합니다.
json_index = names.to_json(orient='index', force_ascii=False)
json_index

'{"0":{"family_name":"홍","first_name":"길동","age":23},"1":{"family_name":"김","first_name":"철수","age":45},"2":{"family_name":"이","first_name":"성계","age":99},"3":{"family_name":"박","first_name":"지성","age":41},"4":{"family_name":"최","first_name":"용수","age":48}}'

In [53]:

#values 는 각 행을 list 로 표현합니다. 열/인덱스 값은 포함하지 않는다는 것을 기억하세요!
json_values = names.to_json(orient='values', force_ascii=False)
json_values

'[["홍","길동",23],["김","철수",45],["이","성계",99],["박","지성",41],["최","용수",48]]'

In [54]:
pd.read_json(json_values).rename(columns={0:'성', 1:'이름', 2:'나이'})

   성  이름  나이
0  홍  길동  23
1  김  철수  45
2  이  성계  99
3  박  지성  41
4  최  용수  48

In [55]:
# table 은 스키마와 데이터를 나눠서 저장합니다.
json_table = names.to_json(orient='table', force_ascii=False)
json_table

'{"schema":{"fields":[{"name":"index","type":"integer"},{"name":"family_name","type":"string"},{"name":"first_name","type":"string"},{"name":"age","type":"integer"}],"primaryKey":["index"],"pandas_version":"0.20.0"},"data":[{"index":0,"family_name":"홍","first_name":"길동","age":23},{"index":1,"family_name":"김","first_name":"철수","age":45},{"index":2,"family_name":"이","first_name":"성계","age":99},{"index":3,"family_name":"박","first_name":"지성","age":41},{"index":4,"family_name":"최","first_name":"용수","age":48}]}'

In [56]:

pd.read_json(json_table, orient='table')

  family_name first_name  age
0           홍         길동   23
1           김         철수   45
2           이         성계   99
3           박         지성   41
4           최         용수   48

# url 에서 HTML 테이블 가져오기

In [45]:
url = 'https://ko.wikipedia.org/wiki/%EB%B0%A9%ED%83%84%EC%86%8C%EB%85%84%EB%8B%A8'
dfs = pd.read_html(url) 
len(dfs)

49

In [46]:
dfs[1]

    이름                                                 소개
0   RM  본명 : 김남준 생년월일 : 1994년 9월 12일 출생지 : 대한민국 서울특별시 ...
1    진  본명 : 김석진 생년월일 : 1992년 12월 4일 출생지 : 대한민국 경기도 과천...
2   슈가  본명 : 민윤기 생년월일 : 1993년 3월 9일 (28세) 출생지 : 대한민국 대...
3  제이홉  본명 : 정호석 생년월일 : 1994년 2월 18일 출생지 : 대한민국 광주광역시 ...
4   지민  본명 : 박지민 생년월일 : 1995년 10월 13일 출생지 : 대한민국 부산광역시...
5    뷔  본명 : 김태형 생년월일 : 1995년 12월 30일 출생지 : 대한민국 대구광역시...
6   정국  본명 : 전정국 생년월일 : 1997년 9월 1일 출생지 : 대한민국 부산광역시 북...

In [47]:
dfs[1][0:4]

    이름                                                 소개
0   RM  본명 : 김남준 생년월일 : 1994년 9월 12일 출생지 : 대한민국 서울특별시 ...
1    진  본명 : 김석진 생년월일 : 1992년 12월 4일 출생지 : 대한민국 경기도 과천...
2   슈가  본명 : 민윤기 생년월일 : 1993년 3월 9일 (28세) 출생지 : 대한민국 대...
3  제이홉  본명 : 정호석 생년월일 : 1994년 2월 18일 출생지 : 대한민국 광주광역시 ...

In [48]:
dfs=pd.read_html(url,na_values='--')
dfs[1][0:4]

    이름                                                 소개
0   RM  본명 : 김남준 생년월일 : 1994년 9월 12일 출생지 : 대한민국 서울특별시 ...
1    진  본명 : 김석진 생년월일 : 1992년 12월 4일 출생지 : 대한민국 경기도 과천...
2   슈가  본명 : 민윤기 생년월일 : 1993년 3월 9일 (28세) 출생지 : 대한민국 대...
3  제이홉  본명 : 정호석 생년월일 : 1994년 2월 18일 출생지 : 대한민국 광주광역시 ...